Revit 2024 API
FootPrintRoof.Offset Property
Retrieve or set the Offset of the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double this[
	ModelCurve pCurve
] { get; set; }
Visual Basic
Public Property Offset ( _
	pCurve As ModelCurve _
) As Double
	Get
	Set
Visual C++
public:
property double Offset[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
Parameters
pCurve
Type: Autodesk.Revit.DB.ModelCurve
See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace